  -----

  insert into [УГЛ]
  (
  [Джерело]
      ,[Пріоритет]
      ,[№ звернення]
      ,[Статус]
      ,[Підстатус]
      ,[Створено]
      ,[Виконавці]
      ,[Питання]
      ,[Зміст]
      ,[Файли]
      ,[Територіальна одиниця]
      ,[Змінено]
      ,[Відправлено]
      ,[За особливою умовою]
      ,[За суб’єктом]
      ,[Заявник]
      ,[Тип заявника]
      ,[Стать]
      ,[Адреса]
      ,[Телефон]
      ,[E-mail]
      ,[Соціальний стан]
      ,[Категорія]
      ,[Дата народження]
      ,[Код ЄДРПОУ/ІНН]
      ,[Форма власності]
      ,[Контактна особа]
      ,[Автор]
      ,[Закрито]
      ,[Вирішити до]
      ,[Дата відповіді]
      ,[Відповідь надано]
      ,[Вихідний номер]
      ,[Потребує дзвінка]
      ,[Результат зворотного зв’язку]
      ,[Планова дата зворотнього зв’язку]
      ,[Виконавець зворотнього зв’язку]
      ,[Прийнято]
      ,[Коментарі]
  )

  select @p1,-- [nvarchar](100) NULL,
	@p2, --[Пріоритет] [nvarchar](100) NULL,
	@p3, --[№ звернення] [nvarchar](100) NULL,
	@p4, --[Статус] [nvarchar](100) NULL,
	@p5, --[Підстатус] [nvarchar](100) NULL,
	@p6, --[Створено] [datetime] NULL,
	@p7, --[Виконавці] [nvarchar](200) NULL,
	@p8, --[Питання] [nvarchar](500) NULL,
	@p9, --[Зміст] [nvarchar](max) NULL,
	@p10, --[Файли] [nvarchar](200) NULL,
	@p11, --[Територіальна одиниця] [nvarchar](100) NULL,
	@p12, --[Змінено] [datetime] NULL,
	@p13, --[Відправлено] [datetime] NULL,
	@p14, --[За особливою умовою] [nvarchar](200) NULL,
	@p15, --[За суб’єктом] [nvarchar](200) NULL,
	@p16, --[Заявник] [nvarchar](max) NULL,
	@p17, --[Тип заявника] [nvarchar](200) NULL,
	@p18, --[Стать] [nvarchar](200) NULL,
	@p19, --[Адреса] [nvarchar](500) NULL,
	@p20, --[Телефон] [nvarchar](100) NULL,
	@p21, --[E-mail] [nvarchar](100) NULL,
	@p22, --[Соціальний стан] [nvarchar](200) NULL,
	@p23, --[Категорія] [nvarchar](200) NULL,
	@p24, --[Дата народження] [date] NULL,
	@p25, --[Код ЄДРПОУ/ІНН] [nvarchar](100) NULL,
	@p26, --[Форма власності] [nvarchar](100) NULL,
	@p27, --[Контактна особа] [nvarchar](200) NULL,
	@p28, --[Автор] [nvarchar](200) NULL,
	@p29, --[Закрито] [nvarchar](100) NULL,
	@p30, --[Вирішити до] [datetime] NULL,
	@p31, --[Дата відповіді] [datetime] NULL,
	@p32, --[Відповідь надано] [nvarchar](200) NULL,
	@p33, --[Вихідний номер] [nvarchar](200) NULL,
	@p34, --[Потребує дзвінка] [nvarchar](200) NULL,
	@p35, --[Результат зворотного зв’язку] [nvarchar](200) NULL,
	@p36, --[Планова дата зворотнього зв’язку] [datetime] NULL,
	@p37, --[Виконавець зворотнього зв’язку] [nvarchar](200) NULL,
	@p38, --[Прийнято] [nvarchar](200) NULL
  @p39  --[Коментарі] [nvarchar](max)



-- INSERT INTO [dbo].[УГЛ]
--            ([Джерело]
--            ,[Пріоритет]
--            ,[№ звернення]
--            ,[Статус]
--            ,[Створено]
--            ,[Виконавці]
--            ,[Питання]
--            ,[Територіальна одиниця]
--            ,[Змінено]
--            ,[Відправлено]
--            ,[За особливою умовою]
--            ,[Заявник]
--            ,[Контактна особа]
--            ,[Підстатус]
--            ,[Автор]
--            ,[Закрито]
--            ,[Вирішити до]
--            ,[Дата відповіді]
--            ,[Відповідь надано]
--            ,[Вихідний номер]
--            ,[Потребує дзвінка]
--            ,[Результат зворотного зв’язку]
--            ,[Планова дата зворотнього зв’язку]
--            ,[Виконавець зворотнього зв’язку]
--            ,[Прийнято])
--      VALUES
--            (@p1
--            ,@p2
--            ,@p3
--            ,@p4
--            ,@p5
--            ,@p6
--            ,@p7
--            ,@p8
--            ,@p9
--            ,@p10
--            ,@p11
--            ,@p12
--            ,@p13
--            ,@p14
--            ,@p15
--            ,@p16
--            ,@p17
--            ,@p18
--            ,@p19
--            ,@p20
--            ,@p21
--            ,@p22
--            ,@p23
--            ,@p24
--            ,@p25)